[
  {"text": "The patient, a 54-year-old male with a history of chronic obstructive pulmonary disease (COPD) and hypertension, presented to the emergency department with worsening dyspnea and productive cough for the past three days. Physical examination revealed bilateral wheezing and decreased breath sounds. A chest X-ray showed increased interstitial markings consistent with a COPD exacerbation. The patient was started on a course of corticosteroids and bronchodilators, with close monitoring of oxygen saturation levels and respiratory status. He was advised to avoid exposure to respiratory irritants and to follow up with his pulmonologist in one week."},
  {"text": "一名64岁的女性患者因胸痛和呼吸困难被送往急诊科。患者既往有高血压、糖尿病和冠心病病史。心电图显示广泛的ST段抬高，符合急性心肌梗死的表现。心肌标志物检测结果显著升高，证实了心肌梗死的诊断。立即为患者启动抗血小板治疗，并安排了紧急冠状动脉造影，显示前降支严重狭窄。介入治疗后，患者病情稳定，被转入重症监护室继续观察。"},
  {"text": "A 35-year-old female presented with a persistent headache, nausea, and blurred vision over the past two weeks. The patient had a history of migraines, but this headache was described as different, with a constant pressure sensation and photophobia. Neurological examination was significant for papilledema. An urgent MRI of the brain revealed a large mass in the right frontal lobe with surrounding edema, suggestive of a glioblastoma. The patient was referred to neurosurgery for evaluation and potential resection of the tumor, followed by a discussion on adjuvant chemotherapy and radiation therapy."},
  {"text": "这名42岁的男性患者因持续性腹痛和体重减轻来诊。他报告在过去三个月内已经失去了15磅，并伴有间歇性的恶心和呕吐。体格检查发现上腹部压痛，实验室检查结果显示贫血和肝功能异常。CT扫描显示胰头部肿块并伴有胆管扩张，提示胰腺癌的可能性。患者被转介至外科部门讨论手术切除的可能性，并计划进行进一步的影像学检查以确定病变的可切除性。"},
  {"text": "The patient, a 60-year-old male with a history of atrial fibrillation and stroke, was admitted with acute onset of left-sided weakness and difficulty speaking. The patient’s family reported that the symptoms began suddenly while he was watching television. A non-contrast CT scan of the head was performed, revealing a large ischemic stroke in the right middle cerebral artery territory. The patient was not a candidate for thrombolysis due to the time of onset being unclear. He was started on aspirin and statin therapy, and plans were made for rehabilitation to address his motor deficits and speech therapy for aphasia."},
  {"text": "患者是一名患有2型糖尿病的55岁女性，因右足溃疡恶化而入院。患者报告过去一个月溃疡逐渐增大，且最近出现脓性分泌物。体检显示右足大脚趾有深达骨的溃疡，周围皮肤发红，伴有轻度肿胀。血糖控制不佳，血糖水平显著升高。实验室检查显示白细胞计数升高，提示存在感染。足部X光片未显示骨髓炎迹象。患者被给予广谱抗生素，并安排了外科清创手术。"},
  {"text": "A 50-year-old woman with a history of breast cancer treated with lumpectomy and radiation therapy five years ago presented with new onset of shortness of breath and pleuritic chest pain. Physical examination was significant for decreased breath sounds on the left side and dullness to percussion. A chest CT scan revealed a large pleural effusion on the left side with multiple nodules suggestive of metastatic disease. Thoracentesis was performed, and cytology confirmed malignant cells consistent with metastatic breast cancer. The patient was started on systemic chemotherapy and referred to palliative care for symptom management."},
  {"text": "一名40岁的男性患者因反复发作的胸闷和心悸来诊。患者报告在过去六个月中，这种症状多次发生，通常在剧烈运动或情绪紧张时加重。既往体检无异常，但此次心电图检查显示间歇性心房颤动。为了进一步评估心脏结构和功能，安排了超声心动图检查。结果显示左心房轻度扩大，但无明显瓣膜病变。根据患者的症状和心电图表现，考虑到房颤的频率和持续时间，建议患者接受抗凝治疗，并讨论了导管消融术的可能性。"},
  {"text": "The patient, a 30-year-old male with no significant past medical history, presented with sudden onset of severe right lower quadrant abdominal pain. The pain was sharp, constant, and associated with nausea and vomiting. On physical examination, the patient had tenderness at McBurney's point with rebound tenderness and guarding. Laboratory studies revealed an elevated white blood cell count. A CT scan of the abdomen was performed, showing an inflamed appendix with surrounding fat stranding, consistent with acute appendicitis. The patient was taken to the operating room for an urgent laparoscopic appendectomy, which was completed without complications."},
  {"text": "患者是一名患有多发性硬化症的女性，因最近一次疾病复发来诊。她报告在过去两周内出现了右侧肢体无力和步态不稳。体格检查显示右侧偏瘫，并伴有眼球震颤。核磁共振成像显示多个新发白质病灶，提示疾病活动性增加。患者已接受糖皮质激素冲击治疗，并考虑调整其免疫调节治疗方案以更好地控制疾病进展。"},
  {"text": "A 45-year-old male presented with a two-month history of progressive jaundice, dark urine, and unintentional weight loss. The patient had a history of alcohol use disorder but had been sober for the past five years. Physical examination revealed scleral icterus, hepatomegaly, and ascites. Laboratory studies showed elevated liver enzymes, bilirubin, and prolonged prothrombin time. A liver ultrasound revealed cirrhosis with portal hypertension and ascites. Further imaging with a CT scan showed a mass in the head of the pancreas, suggestive of pancreatic cancer with bile duct obstruction. The patient was referred to oncology and hepatology for further management and discussion of potential treatment options."},
  {"text": "这名28岁的女性患者因间歇性头痛、颈部僵硬和发热来诊。她报告在过去一周内出现了这些症状，并伴有恶心和畏光。体格检查显示颈部僵硬，克氏征阳性。血液检查显示白细胞计数升高，腰椎穿刺结果显示脑脊液中白细胞显著增多，蛋白质水平升高，葡萄糖水平降低，提示细菌性脑膜炎的可能性。患者被立即给予广谱抗生素和抗病毒治疗，并安排了进一步的病原学检查以确定感染源。"},
  {"text": "A 70-year-old male with a history of chronic kidney disease stage 4 and poorly controlled hypertension presented to the nephrology clinic with worsening fatigue, edema, and shortness of breath. Laboratory studies revealed a significant decline in renal function, with an estimated glomerular filtration rate (eGFR) of 15 mL/min/1.73 m². The patient was diagnosed with end-stage renal disease (ESRD) and was started on hemodialysis. The nephrologist discussed the importance of dietary restrictions, fluid management, and the possibility of kidney transplantation with the patient and his family."},
  {"text": "患者是一名患有系统性红斑狼疮的35岁女性，因反复发作的关节痛和皮肤红斑来诊。她报告在过去几个月中症状加重，特别是在阳光照射后出现显著的皮肤症状。实验室检查显示抗双链DNA抗体滴度升高，补体水平降低，提示疾病活动性增加。经过讨论，决定调整她的免疫抑制治疗方案，以更好地控制疾病进展。"},
  {"text": "The patient, a 48-year-old female with a history of hypertension and hyperlipidemia, presented to the emergency department with sudden onset of slurred speech, facial droop, and right-sided weakness. The symptoms began 30 minutes prior to arrival. A non-contrast head CT was performed and showed no acute hemorrhage. Given the clinical presentation and time of onset, the patient was administered tissue plasminogen activator (tPA) for acute ischemic stroke. She was closely monitored in the stroke unit, and her symptoms began to improve within the first 24 hours. Follow-up imaging confirmed the resolution of the clot, and the patient was discharged with plans for outpatient physical therapy and stroke prevention management."},
  {"text": "一名30岁的男性患者因剧烈的腹痛和反复呕吐来诊。患者报告在过去24小时内症状加重，尤其是在进食后腹痛加剧。体格检查显示腹部广泛压痛，伴有反跳痛和肌紧张。实验室检查显示白细胞计数显著升高，提示急性腹膜炎的可能性。腹部CT扫描显示胃和小肠的扩张，提示肠梗阻。患者被立即安排进行急诊手术，术中发现小肠扭转，随后进行了手术解扭。手术后患者被转入重症监护室进行进一步的监测和管理。"},
  {"text": "A 65-year-old male with a history of type 2 diabetes and chronic kidney disease presented with a non-healing ulcer on his left foot. The ulcer had been present for several months and had progressively worsened despite conservative treatment. On examination, the ulcer was located on the plantar surface of the foot, with surrounding erythema and purulent drainage. The patient had diminished sensation in both feet, consistent with diabetic neuropathy. Vascular studies showed reduced blood flow to the lower extremities. The patient was started on broad-spectrum antibiotics and referred to vascular surgery for evaluation of possible revascularization. The importance of glycemic control and foot care was emphasized to prevent further complications."},
  {"text": "患者是一名49岁的女性，因反复发作的剧烈头痛和视觉障碍来诊。患者描述头痛为搏动性，常伴有恶心和呕吐，症状通常在月经期间加重。既往有偏头痛病史，但最近几次发作的严重程度有所增加。体格检查未见明显神经系统异常。为了排除其他可能的病因，安排了核磁共振成像，结果显示大脑结构正常，无占位性病变。考虑到症状的加重，建议患者进行更严格的预防性治疗，并讨论了使用偏头痛特异性药物进行急性发作治疗的可能性。"},
  {"text": "A 75-year-old female with a history of osteoporosis and recent hip fracture presented to the emergency department after a fall at home. The patient reported immediate pain in her left hip and inability to bear weight. On examination, the left leg was shortened and externally rotated. X-rays confirmed a displaced femoral neck fracture. The patient was admitted for surgical repair with a hemiarthroplasty. Post-operatively, she was started on anticoagulation for deep vein thrombosis (DVT) prophylaxis and was referred to physical therapy for rehabilitation. The patient’s history of osteoporosis was discussed, and she was started on bisphosphonates to reduce the risk of future fractures."},
  {"text": "这名52岁的男性患者因持续性胸痛来诊。患者报告在过去两周内，尤其是在剧烈运动后，胸痛逐渐加重，并伴有呼吸急促和出汗。体格检查未见明显异常，但心电图显示ST段压低，提示心肌缺血。实验室检查显示心肌标志物升高，进一步确认了心肌缺血的诊断。安排了冠状动脉造影，结果显示左前降支有严重狭窄。患者被立即安排接受经皮冠状动脉介入治疗（PCI），并成功植入支架。术后患者症状显著改善，并被建议进行心脏康复治疗以防止未来的心血管事件。"},
  {"text": "A 40-year-old male presented with a three-month history of progressive difficulty swallowing both solids and liquids. The patient also reported unintentional weight loss of 20 pounds during this period. A barium swallow study was performed and revealed a stricture in the distal esophagus with delayed emptying, suggestive of achalasia. An esophagogastroduodenoscopy (EGD) confirmed the diagnosis and showed no evidence of malignancy. The patient was referred to a gastroenterologist for further management, including options such as pneumatic dilation or surgical myotomy. The patient was counseled on the potential risks and benefits of each treatment option."},
  {"text": "患者是一名患有克罗恩病的33岁女性，因持续的腹痛和腹泻来诊。患者报告在过去六个月中症状逐渐加重，并伴有体重减轻和贫血。体格检查显示右下腹压痛，实验室检查显示C反应蛋白水平升高，提示炎症活动性增加。腹部CT扫描显示回肠末端狭窄和周围脂肪浸润，符合克罗恩病活动期的表现。患者被给予强化免疫抑制治疗，并讨论了外科干预的可能性。"},
  {"text": "The patient, a 65-year-old female with a history of hypertension and osteoarthritis, presented with worsening knee pain and swelling over the past six months. She reported that the pain was exacerbated by weight-bearing activities and was relieved by rest. On examination, there was marked tenderness over the medial joint line and decreased range of motion in the knee. X-rays of the knee showed significant joint space narrowing and osteophyte formation, consistent with advanced osteoarthritis. The patient was started on a combination of physical therapy, nonsteroidal anti-inflammatory drugs (NSAIDs), and was referred to orthopedic surgery for consideration of total knee arthroplasty."},
  {"text": "一名57岁的男性患者因慢性咳嗽和呼吸困难来诊。患者既往有吸烟史，并在过去一年中出现了逐渐加重的呼吸困难。体格检查显示双肺呼吸音减弱，并伴有远端杵状指。胸部X光片显示双侧肺野透明度增加，提示慢性阻塞性肺疾病（COPD）。肺功能检查显示明显的气流受限，证实了COPD的诊断。患者被给予长期氧疗，并被建议戒烟，以减缓疾病的进展。"},
  {"text": "A 30-year-old female with a history of asthma presented to the emergency department with acute shortness of breath, wheezing, and chest tightness. The patient reported that she had recently been exposed to a strong perfume, which triggered her symptoms. On examination, she had diffuse wheezing and accessory muscle use. Her oxygen saturation was 88% on room air. The patient was treated with nebulized bronchodilators, systemic corticosteroids, and supplemental oxygen. After several hours of treatment, her symptoms improved, and she was discharged with a prescription for a short course of oral corticosteroids and instructions to avoid known triggers."},
  {"text": "患者是一名患有风湿性心脏病的65岁女性，因反复发作的心悸和乏力来诊。她报告在过去几个月中，症状逐渐加重，尤其是在劳累后出现明显的呼吸困难。体格检查显示心尖部有收缩期杂音，提示二尖瓣狭窄。心电图显示房颤，进一步支持了风湿性心脏病的诊断。为了评估瓣膜狭窄的程度，安排了超声心动图检查，结果显示二尖瓣口面积显著减少，并伴有左心房扩大。根据检查结果，建议患者接受二尖瓣置换手术，并讨论了术后抗凝治疗的重要性。"},
  {"text": "A 45-year-old male with a history of hypertension, hyperlipidemia, and a previous myocardial infarction presented with sudden onset of chest pain radiating to his left arm and jaw. The pain began while he was shoveling snow and was associated with shortness of breath and diaphoresis. On arrival at the emergency department, the patient was diaphoretic and in visible distress. An electrocardiogram (ECG) showed ST-segment elevation in leads II, III, and aVF, consistent with an inferior wall myocardial infarction. The patient was immediately taken to the cardiac catheterization lab for percutaneous coronary intervention (PCI), where a 90% occlusion of the right coronary artery was found and successfully stented. The patient was transferred to the intensive care unit for further monitoring and management."},
  {"text": "这名34岁的女性患者因反复发作的胃痛和恶心来诊。她报告在过去六个月中，每次进食后胃部不适感加重，并伴有腹胀和早饱。既往无消化道疾病史。体格检查显示上腹部轻度压痛。为了进一步评估，安排了胃镜检查，结果显示十二指肠球部溃疡，伴有幽门螺杆菌感染。患者被给予四联疗法，包括质子泵抑制剂、两种抗生素和铋剂，并建议在治疗结束后进行随访以确认感染的根除情况。"},
  {"text": "A 50-year-old male with a history of chronic liver disease secondary to hepatitis C presented with increasing abdominal distension and discomfort. The patient reported that his abdomen had been progressively enlarging over the past few weeks, and he had noticed swelling in his legs as well. On examination, there was significant abdominal distension with a fluid wave, consistent with ascites. Laboratory studies revealed hypoalbuminemia and elevated liver enzymes. A diagnostic paracentesis was performed, and the fluid analysis was consistent with cirrhosis-related ascites. The patient was started on diuretics and a low-sodium diet, and was referred to a hepatologist for further management, including discussion of liver transplantation."},
  {"text": "患者是一名26岁的男性，因持续性头晕和耳鸣来诊。他报告在过去一个月内，尤其是在头部运动时，这些症状明显加重。既往无耳部疾病史，但最近一次乘飞机后，症状开始加重。体格检查显示耳膜完整，无明显外耳或中耳病变。为了进一步评估，安排了听力测试和颞骨CT扫描，结果显示内耳结构正常，无明显病变。考虑到患者的症状和既往史，初步诊断为良性阵发性位置性眩晕（BPPV），并建议进行手法复位治疗。"},
  {"text": "A 60-year-old female with a history of type 2 diabetes and hypertension presented to the emergency department with sudden onset of chest pain, shortness of breath, and palpitations. The pain was described as a sharp, stabbing sensation that radiated to her back. On physical examination, the patient was diaphoretic, with a blood pressure of 180/110 mmHg and a heart rate of 110 beats per minute. An electrocardiogram (ECG) showed T-wave inversions in the anterior leads, raising concern for an acute coronary syndrome. The patient was given aspirin, nitroglycerin, and beta-blockers, and was taken for an urgent coronary angiogram, which revealed no significant coronary artery disease. Further imaging with a CT scan of the chest showed an aortic dissection extending from the ascending aorta to the iliac arteries. The patient was transferred to the cardiac surgery unit for emergency repair."},
  {"text": "这名45岁的女性患者因反复发作的腹痛和腹泻来诊。她报告在过去几个月中，这些症状逐渐加重，并伴有体重减轻和疲劳。体格检查显示右下腹压痛，实验室检查显示C反应蛋白水平升高，提示炎症活动性增加。腹部CT扫描显示回肠末端狭窄和周围脂肪浸润，符合克罗恩病活动期的表现。患者被给予强化免疫抑制治疗，并讨论了外科干预的可能性。"},
  {"text": "A 75-year-old male with a history of chronic obstructive pulmonary disease (COPD) and hypertension presented to the emergency department with worsening shortness of breath and productive cough. The patient reported that his symptoms had progressively worsened over the past week, despite using his inhalers regularly. On examination, he was in moderate respiratory distress, with bilateral wheezing and decreased breath sounds. A chest X-ray revealed hyperinflated lungs and increased interstitial markings, consistent with a COPD exacerbation. The patient was started on intravenous corticosteroids, nebulized bronchodilators, and supplemental oxygen. He was admitted to the hospital for further management and close monitoring of his respiratory status."},
  {"text": "患者是一名65岁的男性，因最近出现的胸痛和呼吸困难来诊。患者既往有吸烟史，并在过去一年中出现了逐渐加重的呼吸困难。体格检查显示双肺呼吸音减弱，并伴有远端杵状指。胸部X光片显示双侧肺野透明度增加，提示慢性阻塞性肺疾病（COPD）。肺功能检查显示明显的气流受限，证实了COPD的诊断。患者被给予长期氧疗，并被建议戒烟，以减缓疾病的进展。"},
  {"text": "A 30-year-old female with a history of hypothyroidism presented with complaints of fatigue, weight gain, and cold intolerance over the past six months. The patient had been on levothyroxine therapy, but she admitted to inconsistent medication adherence. On examination, the patient appeared sluggish, with dry skin and coarse hair. Laboratory tests revealed an elevated thyroid-stimulating hormone (TSH) level and low free thyroxine (T4), indicating hypothyroidism. The patient’s levothyroxine dosage was adjusted, and she was counseled on the importance of medication adherence. A follow-up appointment was scheduled to reassess her thyroid function."},
  {"text": "这名56岁的女性患者因反复发作的头晕和耳鸣来诊。她报告在过去几个月中，尤其是在头部运动时，这些症状明显加重。既往无耳部疾病史，但最近一次乘飞机后，症状开始加重。体格检查显示耳膜完整，无明显外耳或中耳病变。为了进一步评估，安排了听力测试和颞骨CT扫描，结果显示内耳结构正常，无明显病变。考虑到患者的症状和既往史，初步诊断为良性阵发性位置性眩晕（BPPV），并建议进行手法复位治疗。"},
  {"text": "A 60-year-old male with a history of hypertension and hyperlipidemia presented with sudden onset of severe headache, nausea, and vomiting. The patient reported that the headache was the worst of his life and was associated with neck stiffness and photophobia. On examination, the patient was found to have a positive Brudzinski sign, and his blood pressure was elevated at 200/110 mmHg. A non-contrast head CT was performed and revealed a subarachnoid hemorrhage. The patient was immediately started on intravenous antihypertensive medications to lower his blood pressure, and a neurosurgical consultation was obtained. He was transferred to the intensive care unit for close monitoring and further management."},
  {"text": "患者是一名45岁的男性，因持续性背痛和下肢麻木来诊。患者报告在过去几个月中，背痛逐渐加重，并伴有双腿的麻木感。既往有腰椎间盘突出病史。体格检查显示腰椎区压痛，并伴有下肢反射减弱。为了进一步评估，安排了腰椎磁共振成像（MRI），结果显示L4-L5椎间盘突出，压迫到神经根。考虑到患者的症状和影像学表现，建议进行手术治疗，并讨论了手术的风险和预期结果。"},
  {"text": "A 70-year-old female with a history of atrial fibrillation and diabetes mellitus presented to the emergency department with sudden onset of slurred speech and right-sided weakness. The patient’s family reported that she had been in her usual state of health until the symptoms began abruptly while she was watching television. A non-contrast head CT was performed and revealed an acute ischemic stroke in the left middle cerebral artery (MCA) territory. The patient was started on intravenous tissue plasminogen activator (tPA) within the window period. She was admitted to the stroke unit for further monitoring and rehabilitation, with plans for speech therapy and physical therapy."},
  {"text": "这名33岁的女性患者因持续性关节痛和皮疹来诊。患者报告在过去几个月中，关节痛逐渐加重，特别是在手指和膝盖部位，并伴有面部和胸部的皮疹。体格检查显示双手和膝盖关节有轻度肿胀，面部皮疹呈蝴蝶状分布。实验室检查显示抗核抗体（ANA）阳性，抗双链DNA抗体滴度升高，提示系统性红斑狼疮（SLE）的可能性。经过讨论，决定启动免疫抑制治疗，并安排定期随访以监测疾病的进展。"},
  {"text": "A 55-year-old male with a history of chronic obstructive pulmonary disease (COPD) and congestive heart failure presented with worsening dyspnea and lower extremity edema. The patient reported that his symptoms had been progressively worsening over the past two weeks, despite adherence to his prescribed medications. On examination, he had bilateral crackles on lung auscultation and pitting edema in both legs. A chest X-ray revealed cardiomegaly and pulmonary congestion, consistent with heart failure exacerbation. The patient was started on intravenous diuretics and was admitted to the hospital for further management. His medications were adjusted, and he was counseled on the importance of fluid restriction and daily weight monitoring."},
  {"text": "患者是一名患有慢性阻塞性肺疾病（COPD）的65岁男性，因急性呼吸困难来诊。患者报告在过去几天内出现了逐渐加重的呼吸困难，伴有咳嗽和少量痰液。体格检查显示双肺呼吸音减弱，并伴有双侧细湿啰音。胸部X光片显示肺气肿加重，提示COPD急性加重。患者被给予氧疗和吸入性支气管扩张剂，并建议定期随访以监测病情进展。"},
]